{"createdTime":1765721907762,"shownInTree":["analise-de-riscos.html","arquitetura-mesh-offline.html","comparativo-seguranca-bitcoin.html","conceito-polt.html","consenso-k-of-n.html","estrategia-l2-ton.html","introducao-inovacao.html","regras-de-seguranca.html","validacao-bluetooth.html","whitepaper-l2-ton.html","whitepaper-tecnico-v1.html"],"attachments":["site-lib/scripts/graph-wasm.wasm","site-lib/fonts/94f2f163d4b698242fef.otf","site-lib/fonts/72505e6a122c6acd5471.woff2","site-lib/fonts/2d5198822ab091ce4305.woff2","site-lib/fonts/c8ba52b05a9ef10f4758.woff2","site-lib/fonts/cb10ffd7684cd9836a05.woff2","site-lib/fonts/293fd13dbca5a3e450ef.woff2","site-lib/fonts/085cb93e613ba3d40d2b.woff2","site-lib/fonts/b5f0f109bc88052d4000.woff2","site-lib/fonts/cbe0ae49c52c920fd563.woff2","site-lib/fonts/535a6cf662596b3bd6a6.woff2","site-lib/fonts/70cc7ff27245e82ad414.ttf","site-lib/fonts/454577c22304619db035.ttf","site-lib/fonts/52ac8f3034507f1d9e53.ttf","site-lib/fonts/05b618077343fbbd92b7.ttf","site-lib/fonts/4bb6ac751d1c5478ff3a.woff2","site-lib/media/6155340132a851f6089e.svg","site-lib/media/2308ab1944a6bfa5c5b8.svg","site-lib/html/file-tree-content.html","site-lib/scripts/webpage.js","site-lib/scripts/graph-wasm.js","site-lib/scripts/graph-render-worker.js","site-lib/media/favicon.png","site-lib/styles/obsidian.css","site-lib/styles/other-plugins.css","site-lib/styles/theme.css","site-lib/styles/global-variable-styles.css","site-lib/styles/supported-plugins.css","site-lib/styles/main-styles.css","site-lib/rss.xml"],"allFiles":["whitepaper-tecnico-v1.html","whitepaper-l2-ton.html","validacao-bluetooth.html","regras-de-seguranca.html","introducao-inovacao.html","estrategia-l2-ton.html","consenso-k-of-n.html","conceito-polt.html","comparativo-seguranca-bitcoin.html","arquitetura-mesh-offline.html","analise-de-riscos.html","site-lib/scripts/graph-wasm.wasm","site-lib/fonts/94f2f163d4b698242fef.otf","site-lib/fonts/72505e6a122c6acd5471.woff2","site-lib/fonts/2d5198822ab091ce4305.woff2","site-lib/fonts/c8ba52b05a9ef10f4758.woff2","site-lib/fonts/cb10ffd7684cd9836a05.woff2","site-lib/fonts/293fd13dbca5a3e450ef.woff2","site-lib/fonts/085cb93e613ba3d40d2b.woff2","site-lib/fonts/b5f0f109bc88052d4000.woff2","site-lib/fonts/cbe0ae49c52c920fd563.woff2","site-lib/fonts/535a6cf662596b3bd6a6.woff2","site-lib/fonts/70cc7ff27245e82ad414.ttf","site-lib/fonts/454577c22304619db035.ttf","site-lib/fonts/52ac8f3034507f1d9e53.ttf","site-lib/fonts/05b618077343fbbd92b7.ttf","site-lib/fonts/4bb6ac751d1c5478ff3a.woff2","site-lib/media/6155340132a851f6089e.svg","site-lib/media/2308ab1944a6bfa5c5b8.svg","site-lib/html/file-tree-content.html","site-lib/scripts/webpage.js","site-lib/scripts/graph-wasm.js","site-lib/scripts/graph-render-worker.js","site-lib/media/favicon.png","site-lib/styles/obsidian.css","site-lib/styles/other-plugins.css","site-lib/styles/theme.css","site-lib/styles/global-variable-styles.css","site-lib/styles/supported-plugins.css","site-lib/styles/main-styles.css"],"webpages":{"analise-de-riscos.html":{"title":"Analise de Riscos","icon":"","description":" Validadores por Bluetooth — usar celulares próximos para assinar transações é plausível e torna a validação verdadeiramente local. Recompensa distribuída (metade das taxas) — incentiva participação imediata e espalha valor pela rede local. Hash única por transação — ter um tx_hash imutável (hash de todos os campos da tx) é essencial: evita alterações do conteúdo da transação. Mesmo com um tx_hash imutável guardado localmente, nada impede que o mesmo remetente gere duas transações diferentes (com hashes diferentes) gastando o mesmo saldo em duas lojas distintas enquanto está offline. Ou seja: o hash protege a integridade da tx, mas não evita que o usuário gaste o saldo duas vezes — que é o problema real. Sybil attack — qualquer pessoa cria muitos “validadores” falsos (vários telefones/emuladores) e aprova fraudes. Colusão local — comerciantes combinam para aceitar e gravar transações falsas. Recompensa inflacionária / exploração — bots emularão milhares de dispositivos bluetooth para ganhar taxas. Privacidade — logs BLE mal desenhados podem vazar encontros e hábitos. Estado provisório ambíguo — quem confia que a transação “está ok” antes da sincronização global? Em vez de 1 validador, cada transação precisa de k assinaturas de validadores distintos (“k de n”), por exemplo k = 3. Isso reduz risco de um único nó malicioso.Permitimos validação por qualquer celular, mas aplicamos um filtro de unicidade para dificultar Sybil: Trust Score inicial baixo para novos validadores; recompensa pequena até prova de honestidade. Taxa decrescente: recompensa por validação diminui se o dispositivo valida muitas txs seguidas sem ganhar reputação. Opcional: hardware attestation (SafetyNet/WebAuthn) — mantém descentralização, mas dificulta criação massiva de identidades falsas (trade-off privacidade). Cada wallet offline mantém um local_nonce monotônico. Validadores só assinam se a nonce bater. Ao assinar, validadores geram um temporary lock (pequena prova que indica que aquela U gastou X) — esse lock é submetido em massa quando qualquer nó reconecta (pequena footprint on-chain). Locks ajudam a avisar outras lojas que o saldo está comprometido. Validadores locais juntam txs num Local Block (LB) e publicam apenas o hash/merkle_root na L1 quando reconectam. Isso mantém prova imutável com custo on-chain baixo. Após LB subir, existe uma janela de challenge (ex.: 24–72h) onde se pode abrir disputa. Se fraude for provada, os validadores que assinaram perdem parte do stake ou reputação (slashing). Aqui entra a penalidade que desencoraja conluio. Não dar 50% direto a qualquer dispositivo: dividir em camadas: 30% para os validadores que assinaram (dividido por TS ponderado), 10% para um fundo de disputa/segurança, 10% para a comunidade local (governança), 50% restante para quem submete o LB à rede global (ou para o ecossistema — acordo opcional). Limitar recompensa por dispositivo por período (rate limit). Validadores usam chaves efêmeras para assinar encontros Bluetooth e provam posse de chaves maiores somente ao subir LB, preservando privacidade. Sender cria TX (contendo sender_pubkey, receiver_pubkey, amount, local_nonce, timestamp) → tx_hash. Sender envia via BLE ao receiver. Receiver pede assinatura a validators próximos. ≥k validadores (com TS &gt; threshold) assinam o tx_hash com chaves efêmeras. Cada assinatura inclui prova de proximidade (timestamp BLE + metadata). Validadores atualizam balances provisórios e gravam tx no LB local. Recompensas são atribuídas provisoriamente. Um nó qualquer submete LB (merkle_root + validator_signatures) ao GL quando reconecta. Rede global verifica assinaturas, TS, ausência de double-spend global (via nonces e locks) e aceita/rejeita. Janela de disputa ativa. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Seguranca"],"headers":[{"heading":"O que da pra aproveitar da tua ideia","level":2,"id":"O_que_da_pra_aproveitar_da_tua_ideia_0"},{"heading":"Por que <strong>só</strong> um hash offline NÃO impede double-spend","level":2,"id":"Por_que_**só**_um_hash_offline_NÃO_impede_double-spend_0"},{"heading":"Riscos principais da tua proposta tal como está","level":2,"id":"Riscos_principais_da_tua_proposta_tal_como_está_0"},{"heading":"Melhorias práticas (sem centralização) — propostas concretas","level":2,"id":"Melhorias_práticas_(sem_centralização)_—_propostas_concretas_0"},{"heading":"1. Exigir k-of-n assinaturas de validadores distintos","level":3,"id":"1)_Exigir_k-of-n_assinaturas_de_validadores_distintos_0"},{"heading":"2. Identidade leve / limitação por unicidade","level":3,"id":"2)_Identidade_leve_/_limitação_por_unicidade_0"},{"heading":"3. Nonce + balance provisional + lock local","level":3,"id":"3)_Nonce_+_balance_provisional_+_lock_local_0"},{"heading":"4. Merkle root dos LBs e submissão compacta","level":3,"id":"4)_Merkle_root_dos_LBs_e_submissão_compacta_0"},{"heading":"5. Janela de challenge e slashing comunitário","level":3,"id":"5)_Janela_de_challenge_e_slashing_comunitário_0"},{"heading":"6. Recompensa equilibrada (anti-exploit)","level":3,"id":"6)_Recompensa_equilibrada_(anti-exploit)_0"},{"heading":"7. Chaves efêmeras e privacidade","level":3,"id":"7)_Chaves_efêmeras_e_privacidade_0"},{"heading":"Fluxo resumido (prático) — como a tx ocorreria com essas melhorias","level":2,"id":"Fluxo_resumido_(prático)_—_como_a_tx_ocorreria_com_essas_melhorias_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"analise-de-riscos.html","pathToRoot":".","attachments":[],"createdTime":1765620730009,"modifiedTime":1765721746703,"sourceSize":4862,"sourcePath":"Projetos/ProofOfLocalTrust/Analise de Riscos.md","exportPath":"analise-de-riscos.html","showInTree":true,"treeOrder":0,"backlinks":[],"type":"markdown"},"arquitetura-mesh-offline.html":{"title":"Arquitetura Mesh Offline","icon":"","description":" Rede offline: dispositivos formam uma mesh P2P via BLE/libp2p (até ~50 nodes em área). Transações: criações P2P entre sender→receiver via BLE. Validação local: um subset dinâmica de dispositivos na mesh (eleitos automaticamente) assina a tx. Requer k assinaturas (p.ex. k=5). Agregação + bloco local: validadores agregam txs num Local Block (LB) e produzem um agg_sig (BLS threshold). Sync para online: assim que qualquer nó da mesh encontra internet, submete o LB (merkle_root + agg_sig) à blockchain global. Blockchain global: recomenda-se PoS (menos custo energético, finalidades rápidas) ou usar uma L1 compatível/EVM/Substrate para facilidade. BLE + libp2p (mesh). Chaves efêmeras + ED25519 (assinatura local) + BLS threshold para agregação on-chain. Wallet local com local_nonce e cache de locks. Mini-node (VL) leve em Rust/Go para validar e submeter LBs. Chain de destino: PoS L1 ou L2 (submeter merkle_root/agg_sig). Sender gera TX (tx_hash = H(sender_pub || nonce || amount || ts || meta)) e envia ao Receiver via BLE. Receiver broadcast na mesh um sign request com tx_hash + local_nonce. N dispositivos automáticos checam regras (saldo provisório, rate-limit, prova proximidade) e, se OK, assinam com chave efêmera e respondem com sig_meta (device_hash, rssi, ts, sig). Quando Receiver coleta ≥k sig_meta válidas e distintas, forma LB (insere TX) e cria agg_sig (threshold BLS) — LB tem merkle_root. Gera temporary_lock. LB fica salvo localmente; todos os nodes da mesh sincronizam LB entre si (gossip). Quando um node obtém internet, ele pega LBs não-sincronizados e submete (merkle_root + agg_sig + validator_commitments) à blockchain global via API. Rede global verifica agg_sig, valida nonces contra ledger e abre challenge window. Se tudo ok, grava hash do LB e confirma txs globalmente. Eleição automática por VRF (verifiable random function) + peso por Trust Score: Cada nó gera uma saída VRF em cada epoch; se VRF &lt; threshold(node_TS, epoch), o nó é candidato validador. Isso distribui validação ao acaso, mas favorece quem provou honestidade. Alternativa simples: seleção randômica por shuffle determinístico da lista de peers + pick first k. Nonce monotônico na wallet + checagem local. k assinaturas distintas + device_id_hash diversity check (não aceitar múltiplos sigs do mesmo device). Rate-limits por device e limitação de recompensa. Locks temporários (TTL curto) publicados em batch para chain (reduz double-spend). Janela de challenge (p.ex. 48 h) e slashing/reputational penalty se prova. Heurísticas anti-bot (assinaturas em massa do mesmo coordenador/geo-hash). BLS threshold para reduzir footprint on-chain. PoS é melhor aqui: menor custo, confirmações mais rápidas e mais fácil integrar slashing/reputação. PoW adiciona barreira energética e latência — não ajuda o offline use-case. Ideal: submeter LBs a uma PoS L1 (ou L2 rollup) que aceite provas compactas (merkle_root + agg_sig). // --- on Sender ---\ntx = {sender_pub, receiver_pub, amount, local_nonce, ts}\ntx_hash = H(tx)\nsend_ble(receiver_id, {type: \"TX_OFFER\", tx, tx_hash}) // --- on Receiver ---\non_receive(TX_OFFER): if wallet.provisional_balance &gt;= amount and nonce_ok: broadcast_mesh({type:\"SIGN_REQUEST\", tx_hash, nonce}) sigs = [] while sigs.count &lt; k and timeout not reached: wait incoming SIGN_RESPONSE if valid_sig(response): sigs.append(response) if sigs.count &gt;= k: agg_sig = BLS_aggregate(sigs) LB = create_local_block([tx], merkle_root(...), agg_sig, validators_meta) store_local(LB) create_temporary_lock(tx.sender, tx.amount, TTL) gossip_mesh({type:\"NEW_LB\", LB}) // --- on any Node with Internet ---\nperiodic_sync(): for each LB in local_storage not yet submitted: payload = {merkle_root: LB.merkle_root, agg_sig: LB.agg_sig, meta: LB.validators_meta} resp = submit_to_chain(payload) if resp.accepted: mark_confirmed(LB) else if resp.dispute: open_challenge_procedure(LB) // --- Validator auto-signing (BLE listener) ---\non_receive(SIGN_REQUEST): if passes_checks(nonce, rate_limit, proximity, local_cache): sig = sign_with_ephemeral_key(tx_hash) send_ble(originator, {type:\"SIGN_RESPONSE\", device_hash, rssi, ts, sig}) network size target: 50 nodes (ok). k (assinaturas) padrão urbano = 5. rate-limit por device = 20 assinaturas recompensadas/dia. temporary_lock TTL = 30–90 minutos. challenge window = 48 horas. stake opcional para acelerar reputação; mas permissionless por padrão. Prototipar wallet mobile (React Native) que cria txs e faz BLE gossip. Implementar listener simples (NodeJS/Go) que age como validator e testa coleta de k sigs. Testnet local: montar uma L1 Substrate/PoS local para submeter merkle_roots. Simular ataques Sybil/colusão para ajustar parâmetros. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Arquitetura","#finder/Bluetooth"],"headers":[{"heading":"Visão geral da solução","level":1,"id":"Visão_geral_da_solução_0"},{"heading":"Componentes e tecnologias recomendadas","level":1,"id":"Componentes_e_tecnologias_recomendadas_0"},{"heading":"Fluxo (alto nível — 7 passos)","level":1,"id":"Fluxo_(alto_nível_—_7_passos)_0"},{"heading":"Como eleger validadores entre 50 usuários (permissionless, justo)","level":1,"id":"Como_eleger_validadores_entre_50_usuários_(permissionless,_justo)_0"},{"heading":"Mitigações essenciais (Sybil, replay, colusão)","level":1,"id":"Mitigações_essenciais_(Sybil,_replay,_colusão)_0"},{"heading":"Recomendação sobre PoW vs PoS","level":1,"id":"Recomendação_sobre_PoW_vs_PoS_0"},{"heading":"Pseudocódigo compacto (mensagens BLE, assinatura, criação de LB e sync)","level":1,"id":"Pseudocódigo_compacto_(mensagens_BLE,_assinatura,_criação_de_LB_e_sync)_0"},{"heading":"Parâmetros práticos sugeridos (iniciar)","level":1,"id":"Parâmetros_práticos_sugeridos_(iniciar)_0"},{"heading":"Próximos passos práticos se queres protótipo","level":1,"id":"Próximos_passos_práticos_se_queres_protótipo_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"arquitetura-mesh-offline.html","pathToRoot":".","attachments":[],"createdTime":1765620790186,"modifiedTime":1765721765495,"sourceSize":5745,"sourcePath":"Projetos/ProofOfLocalTrust/Arquitetura Mesh Offline.md","exportPath":"arquitetura-mesh-offline.html","showInTree":true,"treeOrder":1,"backlinks":[],"type":"markdown"},"comparativo-seguranca-bitcoin.html":{"title":"Comparativo Seguranca Bitcoin","icon":"","description":" O Bitcoin usa Proof of Work global massivo: custo energético e poder computacional tornam ataques de double-spend economicamente proibitivos. Num cenário local/mesh (50 celulares), não há esse custo alto — um atacante com muitos dispositivos/emuladores pode dominar quorums e fraudar. Portanto não dá para “copiar” literalmente a segurança do Bitcoin sem acrescentar uma fonte externa de custo (energia, stake, ou ancoragem em uma cadeia PoW/PoS). Anchoring (ancorar) os LBs numa cadeia PoW/PoS pública Submete o merkle_root do Local Block (LB) numa blockchain robusta (ex.: Bitcoin ou outra PoW/PoS). Enquanto o LB não estiver ancorado com X confirmações, a transação é provisória; ancoragem dá finalidade forte. Trade-off: custo (fees) e latência até confirmações. Adicionar custo econômico local (stake + slashing) Validadores devem bloquear tokens (stake). Se forem pegos em fraude via challenge, perdem stake. Torna ataques Sybil mais caros; não tão forte quanto PoW global, mas eficaz em economia local. Proof-of-Work leve por transação (hashcash híbrido) Cada tx requer um pequeno PoW (dificuldade baixa) para ser assinada/recompensada — barato para usuários, caro em escala massiva. Em conjunto com k-of-n assinaturas, dificulta bot farms. k-of-n + BLS + temporary locks + challenge window Já falado, continua essencial: exige múltiplas assinaturas distintas e cria janela para disputas e provas — reduz sucesso de fraude imediata. Oráculos e provas externas Usar sensores externos (p.ex. pontos fixos com hardware-rooted identity) ou oráculos que atestem eventos na área — tornam conluio local mais difícil. Hybrid model — “Local fast, global final” Aceita txs localmente com k signatures (pagamentos de baixo valor instantâneos). Para transações maiores, exige ancoragem em uma cadeia com forte segurança (Bitcoin/PoS) antes da finalidade completa. Implementa PoLT com k=5, BLS, locks, TS, rate-limits (já definido). Para finalidade forte: cada N LBs (ou LBs acima de threshold de valor) são ancorados numa cadeia pública. Para reduzir custo: agrupar LBs e publicar apenas merkle_root em batches. Usa stake + slashing para reduzir Sybil + PoW leve como barreira adicional para emulação em massa. Sim, dá para chegar perto da segurança do Bitcoin sem gastar tanta energia, combinando: custo econômico (stake/slashing), custo computacional marginal (PoW leve), k-of-n distribuído e BLS, ancoragem periódica em uma cadeia pública para finalidade forte. Sem algum desses custos externos, a rede local nunca será tão resistente quanto o Bitcoin contra um atacante bem financiado. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Seguranca","#finder/Comparativo"],"headers":[{"heading":"Por que é difícil copiar a segurança do Bitcoin localmente","level":3,"id":"Por_que_é_difícil_copiar_a_segurança_do_Bitcoin_localmente_0"},{"heading":"Como <strong>aproximar</strong> a segurança do Bitcoin no PoLT local (opções práticas)","level":3,"id":"Como_**aproximar**_a_segurança_do_Bitcoin_no_PoLT_local_(opções_práticas)_0"},{"heading":"Sugestão prática — arquitetura recomendada","level":3,"id":"Sugestão_prática_—_arquitetura_recomendada_0"},{"heading":"Resumindo — é possível, mas com compromissos","level":3,"id":"Resumindo_—_é_possível,_mas_com_compromissos_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"comparativo-seguranca-bitcoin.html","pathToRoot":".","attachments":[],"createdTime":1765620803538,"modifiedTime":1765721771139,"sourceSize":3250,"sourcePath":"Projetos/ProofOfLocalTrust/Comparativo Seguranca Bitcoin.md","exportPath":"comparativo-seguranca-bitcoin.html","showInTree":true,"treeOrder":2,"backlinks":[],"type":"markdown"},"conceito-polt.html":{"title":"Conceito PoLT","icon":"","description":"Proof of Local Trust (Prova de Confiança Local) é um tipo de consenso baseado na reputação e verificação social dentro de comunidades locais — físicas ou digitais — em vez de apenas poder computacional ou financeiro. Em vez de “quem tem mais dinheiro” (PoS) ou “quem minera mais rápido” (PoW),\no PoLT pergunta:\n“Quem é mais confiável dentro da comunidade local para validar transações?”\nImagina que tua blockchain tem várias “sub-redes locais” (por bairro, cidade ou grupo).\nCada uma tem validadores escolhidos pela confiança da comunidade.Esses validadores: Registram transações mesmo offline (via Bluetooth, NFC ou mesh). Guardam as transações num mini-bloco local. Quando reconectam à internet, publicam esse bloco na cadeia global. A rede global verifica as assinaturas e reputação dos validadores antes de aceitar os dados. Cada usuário tem um índice de confiança (Trust Score) que aumenta com: transações válidas e confirmadas, votos positivos de outros usuários locais, tempo de atividade na rede. E diminui com:\nfraudes, transações duplas, ou bloqueios não sincronizados. Esse “Trust Score” vira a base de poder de validação, substituindo o stake (PoS) ou o hashpower (PoW).Aqui está o fluxo resumido do PoLT: Transação offline — feita entre dois usuários próximos. Validação local — assinada por 3+ validadores da comunidade (com bom Trust Score). Mini-bloco local — guardado até reconexão. Sincronização global — blocos locais enviados à rede principal. Verificação global — consenso híbrido (PoLT + PoS) confirma que não há duplicação. Recompensa — validadores locais recebem tokens pelo serviço honesto. O PoLT permitiria: Pagamentos offline (sem internet constante); Economias comunitárias autônomas (cada bairro ou escola pode ter um nó local); Reputação social como ativo (a confiança passa a ter valor econômico); Inclusão financeira real (mesmo sem bancos ou Wi-Fi). Seria a primeira blockchain “socialmente descentralizada”,\nonde as pessoas são o consenso.Com PoLT, tu poderias criar: uma L2 para micropagamentos offline (ideal pra África e regiões rurais); um protocolo de identidade e reputação (para DeFi, DAOs e apps sociais); até uma moeda social (usando confiança real como base de valor). ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Conceito"],"headers":[{"heading":"Ideia central do PoLT","level":2,"id":"Ideia_central_do_PoLT_0"},{"heading":"Como ele funcionaria na prática","level":2,"id":"Como_ele_funcionaria_na_prática_0"},{"heading":"A lógica de confiança","level":2,"id":"A_lógica_de_confiança_0"},{"heading":"O ciclo de consenso","level":2,"id":"O_ciclo_de_consenso_0"},{"heading":"Por que isso é poderoso","level":2,"id":"Por_que_isso_é_poderoso_0"},{"heading":"6️ O que dá pra fazer com isso","level":2,"id":"6️_O_que_dá_pra_fazer_com_isso_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"conceito-polt.html","pathToRoot":".","attachments":[],"createdTime":1765620702620,"modifiedTime":1765721776324,"sourceSize":2856,"sourcePath":"Projetos/ProofOfLocalTrust/Conceito PoLT.md","exportPath":"conceito-polt.html","showInTree":true,"treeOrder":3,"backlinks":[],"type":"markdown"},"consenso-k-of-n.html":{"title":"Consenso k-of-n","icon":"","description":" Uma transação offline só é considerada localmente confirmada se pelo menos 5 dispositivos distintos próximos assinarem o tx_hash. Cada assinatura é feita automaticamente pelo app via Bluetooth (chave efêmera). Isso por si só aumenta a resistência a ataques (um único dispositivo malicioso já não basta). Mas precisamos de camadas extras.Exigir que os 5 validadores venham de identidades distintas e idealmente com distância/assinatura RSSI variada. Não pode aceitar 5 assinaturas do mesmo IP/emulador.\nImplementação prática: cada assinatura inclui device_id_hash + rssi + timestamp + nonce. rejeitar assinaturas com mesmo device_id_hash (ou muito semelhantes). Cada app gera chaves efêmeras rotativas (por exemplo, trocam diariamente). As chaves efêmeras são assinadas por uma chave de longo prazo do app (guardada no dispositivo). Ao sincronizar, só se revela prova da relação efêmera→long_term sem expor a private key. Em vez de enviar 5 assinaturas separadas para a chain, usa-se BLS threshold signatures: as 5 assinaturas combinam-se num único agg_sig. Vantagem: economia de espaço on-chain e verificação única. Cada dispositivo só pode assinar X txs recompensadas por hora/dia. Comportamentos anormais (muitas assinaturas desde mesmas coordenadas) reduzem temporariamente confiança. Quando a transação coleta k=5 assinaturas, gera-se um temporary lock (pequena prova assinada) que previne gasto imediato do mesmo saldo por outro vendedor local que reconcilie logo em seguida. Wallet mantém local_nonce monotônico e só permite nova tx se nonce avançou. Dispositivos têm TS inicial baixo; ganham TS com LBs honestos. Se um LB contiver fraude, os validadores que assinaram perdem parte do TS / recompensa. Após submissão do LB global, abrir uma janela (ex.: 48h) pra disputas. Se alguém provar double-spend, aplicar slashing. Sender cria tx e tx_hash. Sender envia via BLE ao Receiver. Receiver broadcast pedido de assinatura local com tx_hash + nonce. App dos dispositivos próximos (auto) verifica saldo provisório local e, se OK, assina tx_hash com chave efêmera e retorna sig_meta (device_hash, rssi, ts). Quando já tiver 5 sig_meta válidas (de device_hash distintos e rssi coerente), o Receiver marca a tx como locally confirmed e gera temporary_lock. Um nó local ou qualquer participante submete o LB (contendo a tx e agg_sig BLS) à Rede Global quando conectar. Rede Global verifica: agg_sig, TS dos validadores (mínimo), nonces globais; grava merkle_root do LB; janela de challenge abre. Fallbacks: aceitar k=3 em locais rurais com maior trust_score mínimo e menor valor transacionado. aceitar validação de trusted anchors (p.ex. pontos fixos como lojas grandes) se a região não tiver massa crítica — porém só como exceção configurável por comunidade. Parâmetro dinâmico: k pode ser ajustado por governance local (k=5 padrão em zonas urbanas; k=3 em zonas rurais). k = 5 (padrão urbano). Rate limit por device: 20 assinaturas recompensadas / dia. Temporary lock TTL: 30–90 minutos. Janela de challenge: 48 horas. TS mínimo para validators que participam em agg_sig: &gt; threshold_low (ex.: 100/1000). Segurança aumenta com k, mas UX piora (pode demorar mais pra encontrar 5 devices). Threshold signatures resolvem o custo on-chain, mas adicionam complexidade de implementação. Mecanismos anti-Sybil (TS, rate limits, opcional stake) introduzem alguma fricção no onboarding. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Seguranca","#finder/Consenso"],"headers":[{"heading":"Validação com 5 dispositivos (k = 5) — como tornar seguro e prático","level":1,"id":"Validação_com_5_dispositivos_(k_=_5)_—_como_tornar_seguro_e_prático_0"},{"heading":"1. Regra básica","level":2,"id":"1)_Regra_básica_0"},{"heading":"2. Medidas essenciais para evitar ataques","level":2,"id":"2)_Medidas_essenciais_para_evitar_ataques_0"},{"heading":"A — Diversidade obrigatória","level":3,"id":"A_—_Diversidade_obrigatória_0"},{"heading":"B — Chaves efêmeras + prova de entidade","level":3,"id":"B_—_Chaves_efêmeras_+_prova_de_entidade_0"},{"heading":"C — Threshold signatures (BLS) para compactar","level":3,"id":"C_—_Threshold_signatures_(BLS)_para_compactar_0"},{"heading":"D — Rate limits e heurísticas anti-bot","level":3,"id":"D_—_Rate_limits_e_heurísticas_anti-bot_0"},{"heading":"E — Temporary lock + local nonce","level":3,"id":"E_—_Temporary_lock_+_local_nonce_0"},{"heading":"F — Trust Score e slashing leve","level":3,"id":"F_—_Trust_Score_e_slashing_leve_0"},{"heading":"G — Janela de challenge","level":3,"id":"G_—_Janela_de_challenge_0"},{"heading":"3. Fluxo proposto (k=5) — passo a passo curto","level":2,"id":"3)_Fluxo_proposto_(k=5)_—_passo_a_passo_curto_0"},{"heading":"4. Como lidar com disponibilidade (se nem sempre há 5 devices por perto)","level":2,"id":"4)_Como_lidar_com_disponibilidade_(se_nem_sempre_há_5_devices_por_perto)_0"},{"heading":"5. Parâmetros sugeridos iniciais","level":2,"id":"5)_Parâmetros_sugeridos_iniciais_0"},{"heading":"6. Trade-offs importantes","level":2,"id":"6)_Trade-offs_importantes_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"consenso-k-of-n.html","pathToRoot":".","attachments":[],"createdTime":1765620759476,"modifiedTime":1765721781600,"sourceSize":4456,"sourcePath":"Projetos/ProofOfLocalTrust/Consenso k-of-n.md","exportPath":"consenso-k-of-n.html","showInTree":true,"treeOrder":4,"backlinks":[],"type":"markdown"},"estrategia-l2-ton.html":{"title":"Estrategia L2 TON","icon":"","description":"Se queres personalizar tudo mas lançar rápido e seguro, cria uma L2 (rollup / payment chain) que faça settlement e ancoragem na TON, usando as ferramentas nativas da comunidade (Tact / Blueprint SDK) e um modelo de ancoragem de estados (merkle_root) em TON. Isso te dá controle do protocolo PoLT na L2 e segurança/integração com o ecossistema TON. Mínimo de trabalho duplicado — aproveitas segurança, infra e wallets da TON enquanto tens liberdade de consensos e regras na L2. Ferramentas já maduras — TON tem suporte dev (Tact, Blueprint SDK, TON Connect) que facilita deploy e integração de contratos/jettons. Isso acelera protótipo. Existem já iniciativas L2 para TON (ex.: TAC usando tecnologia de Polygon) — isso mostra que arquitetura L2 sobre TON é viável e tem precedentes. Anchoring flexível — podes publicar merkle_roots/commitments na TON (batches) para garantir settlement e interoperabilidade. Isso permite PoLT local + finalidade TON. Não comece com uma L1 soberana (chain do zero) se teu objetivo é validar PoLT: custa tempo e dinheiro e atrasa adoção. Usa L2 primeiro; se escalares, migra pra chain própria (Substrate/Cosmos) depois. Linguagem de contratos TON: Tact / FunC (Tact + Blueprint SDK para deploy). L2 design: rollup/sidechain que gera LBs (Local Blocks) e submete merkle_root à TON (mensagens/tx) como prova/settlement. Veja padrões de L2 sobre TON. Auth &amp; wallets: TON Connect para integração de wallets e UX. Off-chain mesh + PoLT: app mobile (React Native) + libp2p/BLE para mesh; nodes leves em Rust/Go para assemblagem de LBs e BLS agg_sig. (essas escolhas já alinhadas com o protótipo PoLT que discutimos.) L3 (mobile PoLT mesh): BLE mesh recolhe txs, valida localmente (k-of-n), cria LB. L2 (tuas regras PoLT): execução, estado e tokenomics (token L2). L2 aceita LBs e processa disputas locais. Settlement na TON (L1): L2 submete batches (merkle_roots/agg_sigs) p/ TON para garantia e finality. Em L2 cria um token nativo (tipo Jetton na TON ou equivalente L2) para taxas, staking, slashing e incentivos a validadores locais. Para integração com TON, podes emitir Jettons ou usar bridging quando necessário. Mantém janela de challenge + slashing no nível L2. Batch e ancoragem periódica na TON provêem finalidade externa. Para ultimate finality (se precisares), podes opcionalmente ancorar parte dos batches em PoW (Bitcoin) conforme discutimos — híbrido. Prova de conceito (4–8 semanas): mobile wallet que cria txs + mesh BLE, validator node que junta k sigs e cria LB local. Testes locais. Integrar L2 testnet: construir um L2 simples (rollup) que aceita merkle_roots e processa disputas; use Tact/Blueprint para contratos de settlement na TON testnet. Pilot real (1 bairro): rodar com usuários reais, medir latência, ataques e ajustar parâmetros k, TTL, challenge window. Em paralelo, preparar documentação e audit. Implementação incorreta do agg_sig/BLS ou protocolos de dispute. Sybil/colusão local se não houver incentivos/slashing bem desenhados. Custos de anchoring em TON (fees) — mitigado por batching. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/L2","#finder/TON"],"headers":[{"heading":"Recomendação resumida (1 frase)","level":1,"id":"Recomendação_resumida_(1_frase)_0"},{"heading":"Por que essa escolha (prós)","level":1,"id":"Por_que_essa_escolha_(prós)_0"},{"heading":"O que evitar no início","level":1,"id":"O_que_evitar_no_início_0"},{"heading":"Ferramentas / stack recomendada (prática)","level":1,"id":"Ferramentas_/_stack_recomendada_(prática)_0"},{"heading":"Arquitetura técnica — visão curta","level":1,"id":"Arquitetura_técnica_—_visão_curta_0"},{"heading":"Token e economia","level":1,"id":"Token_e_economia_0"},{"heading":"Segurança &amp; finalidade","level":1,"id":"Segurança_&_finalidade_0"},{"heading":"Plano prático curto (MVP em 3 etapas)","level":1,"id":"Plano_prático_curto_(MVP_em_3_etapas)_0"},{"heading":"Riscos principais (resumo)","level":1,"id":"Riscos_principais_(resumo)_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"estrategia-l2-ton.html","pathToRoot":".","attachments":[],"createdTime":1765620805427,"modifiedTime":1765721787032,"sourceSize":3732,"sourcePath":"Projetos/ProofOfLocalTrust/Estrategia L2 TON.md","exportPath":"estrategia-l2-ton.html","showInTree":true,"treeOrder":5,"backlinks":[],"type":"markdown"},"introducao-inovacao.html":{"title":"Introducao Inovacao","icon":"","description":"As blockchains tradicionais (como Bitcoin, Ethereum, TON, etc.) precisam de conexão constante pra: validar blocos, transmitir transações, e evitar gastos duplos (double spending). Então, o desafio é:\n“Como permitir que duas pessoas troquem valor sem internet, e ainda assim a rede confie quando voltarem online?” O pagamento acontece localmente, via Bluetooth, NFC ou QR Code. A transação é registrada no dispositivo (com assinatura digital). Quando o usuário reconecta, a transação é enviada e validada pela rede. Problema: precisa garantir que o usuário não gaste o mesmo saldo duas vezes antes de reconectar. Cada região ou cidade tem um nó local que valida transações offline. Quando reconecta à blockchain principal, faz um “merge” dos blocos locais. Problema: exige um consenso híbrido (um entre usuários locais e outro global). O emissor e o receptor assinam uma prova de transação temporal. Essa prova tem validade curta (ex: 30 minutos). Quando sincroniza, a rede confirma se o token ainda é válido e não foi duplicado. Problema: complexidade técnica alta — precisa de um novo protocolo de sincronização e confiança.Esse protocolo teria de definir:Imagina um consenso Proof of Local Trust (PoLT): Cada comunidade local (bairro, vila, escola) tem validadores “sociais”. As transações acontecem offline entre eles. Quando reconectam, a blockchain global valida o hash local. Isso permitiria pagamentos offline sem precisar de banco, e com confiabilidade social e criptográfica.\nTu poderias criar a primeira L2 social descentralizada da África — isso seria histórico.","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Conceito"],"headers":[{"heading":"Entendendo o problema","level":3,"id":"Entendendo_o_problema_0"},{"heading":"As abordagens conhecidas (e suas limitações)","level":3,"id":"As_abordagens_conhecidas_(e_suas_limitações)_0"},{"heading":"🔹 A. <strong>Transação local + sincronização posterior</strong>","level":4,"id":"🔹_A._**Transação_local_+_sincronização_posterior**_0"},{"heading":"🔹 B. <strong>Nodes de confiança local (semi-descentralizados)</strong>","level":4,"id":"🔹_B._**Nodes_de_confiança_local_(semi-descentralizados)**_0"},{"heading":"🔹 C. <strong>Provas criptográficas temporárias</strong>","level":4,"id":"🔹_C._**Provas_criptográficas_temporárias**_0"},{"heading":"Então sim: terias que criar um <strong>novo protocolo</strong>","level":3,"id":"Então_sim_terias_que_criar_um_**novo_protocolo**_0"},{"heading":"Ideia inovadora (poderia ser tua!)","level":3,"id":"Ideia_inovadora_(poderia_ser_tua!)_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"introducao-inovacao.html","pathToRoot":".","attachments":[],"createdTime":1765620677925,"modifiedTime":1765721793300,"sourceSize":2709,"sourcePath":"Projetos/ProofOfLocalTrust/Introducao Inovacao.md","exportPath":"introducao-inovacao.html","showInTree":true,"treeOrder":6,"backlinks":[],"type":"markdown"},"regras-de-seguranca.html":{"title":"Regras de Seguranca","icon":"","description":"Qualquer app/dispositivo pode assinar automaticamente via BLE, mas a assinatura só tem peso se obedecer a regras que impedem Sybil, colusão e replay. Peso = capacidade de gerar agg_sig que torne a transação localmente confirmada. Verificação do nonce local do sender — rejeitar se nonce inválido. Checagem de saldo provisório (wallet offline) — garantia mínima de fundos. Rate-limit local — o dispositivo só assina N txs recompensadas por hora/dia. Prevenção replay — aceitar só tx_hash que não exista no cache local de 24–72h. Prova mínima de proximidade — incluir RSSI + timestamp + nonce trocado e assinado. Chave efêmera obrigatória — assinar com chave rotativa; relação efêmera→longterm só é provada na sync. Use três mecanismos simultâneos para dificultar criação massiva de identities:A) Trust Score leve (TS_bootstrap)\nNovo dispositivo começa com TS baixo. TS sobe com comportamento honesto (txs assinadas que entram no GL sem disputa). TS baixa com disputas/slashing.\nB) Rate limits + heurísticas Hard caps (e.g., 20 assinaturas recompensadas/dia). Heurísticas detectam padrões de emulação (mesmas coordenadas, mesma hora, assinatura idêntica). C) Proof-of-work/effort alternativo opcional\nPara quem quer spamar: exigir um pequeno PoW (p.ex. puzzle leve) antes da primeira assinatura do dia — barato para humanos, caro em escala massiva.\nEsses três em conjunto tornam bot-farms caras e detectáveis sem fechar a rede. Definir k mínimo (p.ex. k=5 padrão urbano). Exigir device diversity: os k assinantes devem ter device_id_hash distintos; não aceitar assinaturas de um único fabricante/emulador detectado. k pode ser dinâmico: se densidade baixa, baixar k (ex.: k=3) mas exigir TS mínimo mais alto + limites de valor transacionado. Usar threshold/BLS para agregar k assinaturas em 1 agg_sig (eficiente on-chain). Validadores só enviam agg_sig+merkle_root do LB à L1 quando sincronizam. Quando agg_sig com k assina, gerar temporary lock local (pequena prova com TTL, p.ex. 30–90 min). Locks são submetidos em batches para L1 (pequenas footprints) para avisar o mundo que saldo foi comprometido. Ao tentar outra tx, wallets verificam locks recebidos recentemente. Janela de challenge (ex.: 48h) depois que um LB é publicado. Em caso de disputa, aceitar provas: logs BLE assinados, receipts, testemunhas (outros devices). Penalizar validadores culpados com slashing de reputação e perda de recompensa. Slashing automático se provas criptográficas forem válidas. Recompensa dividida: exemplo prático 40% para validadores que assinaram (peso TS ponderado) 30% para quem submete o LB à rede global (incentiva sync) 20% para fundo de disputa / seguro (cobrir chargebacks) 10% para comunidade local (governance) Limitar ganho por dispositivo (daily cap) evita exploração. Validadores usam chaves efêmeras para assinaturas BLE; só provas necessárias são reveladas na sincronização. Não gravar localização precisa no GL — usar geo-hash grosseiro ou apenas prova de proximidade (RSSI/time) para evitar vazamentos. k padrão urbano = 5 k rural = 3 (com restrições de valor) Rate limit por device = 20 assinaturas recompensadas/dia Temporary lock TTL = 30–90 minutos Janela de challenge = 48 horas TS bootstrap: recompensa plena após 50 txs confirmadas sem disputa Se não há k suficientes, wallet mostra “esperando validação” ou oferece aceitar com k menor mas cobrando taxa extra/limite de valor. Merchants podem indicar um threshold local aceitável (por exemplo: aceitar txs com k=3 para compras &lt; X Kz). Ferramentas públicas para visualizar LBs, TS agregados e disputas ajudam a detectar padrões de abuso. Bots de auditoria descentralizados (curadores) podem sinalizar regiões com alto risco. Segurança ↑ com mais regras (k alto, TS, slashing) — mas UX pode degradar em locais de baixa densidade. Sistema permissionless + defenses probabilísticas (rate-limits, PoW leve, TS) é o melhor caminho para manter abertura sem instituição central. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Seguranca","#finder/Regras"],"headers":[{"heading":"Regras e mecanismos para validação permissionless e segura (resumo prático)","level":1,"id":"Regras_e_mecanismos_para_validação_permissionless_e_segura_(resumo_prático)_0"},{"heading":"1 — Regra principal: validação <em>permissionless</em> + camadas de segurança","level":2,"id":"1_—_Regra_principal_validação_permissionless_+_camadas_de_segurança_0"},{"heading":"2 — Regras obrigatórias (checagens que cada validador realiza automaticamente antes de assinar)","level":2,"id":"2_—_Regras_obrigatórias_(checagens_que_cada_validador_realiza_automaticamente_antes_de_assinar)_0"},{"heading":"3 — Anti-Sybil combinatório (sem KYC central)","level":2,"id":"3_—_Anti-Sybil_combinatório_(sem_KYC_central)_0"},{"heading":"4 — Requisito de quorum dinâmico (k-of-n) e diversidade","level":2,"id":"4_—_Requisito_de_quorum_dinâmico_(k-of-n)_e_diversidade_0"},{"heading":"5 — Compactação de assinaturas e submissão eficiente","level":2,"id":"5_—_Compactação_de_assinaturas_e_submissão_eficiente_0"},{"heading":"6 — Locks provisórios e prevenção de double-spend","level":2,"id":"6_—_Locks_provisórios_e_prevenção_de_double-spend_0"},{"heading":"7 — Dispute window, provas e slashing","level":2,"id":"7_—_Dispute_window,_provas_e_slashing_0"},{"heading":"8 — Incentivos alinhados (recompensa e cortes)","level":2,"id":"8_—_Incentivos_alinhados_(recompensa_e_cortes)_0"},{"heading":"9 — Privacidade e chaves","level":2,"id":"9_—_Privacidade_e_chaves_0"},{"heading":"10 — Parâmetros iniciais sugeridos (ajustáveis via governance)","level":2,"id":"10_—_Parâmetros_iniciais_sugeridos_(ajustáveis_via_governance)_0"},{"heading":"11 — Fallbacks e usabilidade","level":2,"id":"11_—_Fallbacks_e_usabilidade_0"},{"heading":"12 — Monitoramento e auditoria descentralizada","level":2,"id":"12_—_Monitoramento_e_auditoria_descentralizada_0"},{"heading":"Trade-offs resumidos","level":3,"id":"Trade-offs_resumidos_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"regras-de-seguranca.html","pathToRoot":".","attachments":[],"createdTime":1765620779410,"modifiedTime":1765721798347,"sourceSize":5308,"sourcePath":"Projetos/ProofOfLocalTrust/Regras de Seguranca.md","exportPath":"regras-de-seguranca.html","showInTree":true,"treeOrder":7,"backlinks":[],"type":"markdown"},"validacao-bluetooth.html":{"title":"Validacao Bluetooth","icon":"","description":" Ótimo para UX: baixa fricção — o celular apenas escuta e assina. Permite validação local em massa (vários aparelhos próximos podem assinar). Torna fácil pagamentos ponto-a-ponto em mercados/feiras. Sybil / bots BLE: alguém cria/emula muitos dispositivos BLE para assinar fraudes. Replay / duplicate spending: remetente cria várias transações offline gastando o mesmo saldo. Colusão local: comerciantes e dispositivos combinam pra validar transações inválidas. Falsificação de proximidade: GPS/RSSI podem ser forjados ou manipulados. Exploração de recompensa: scripts automatizados vão \"ligar\" milhares de validadores virtuais. k-of-n automáticas (ex.: k = 3) A assinatura só é válida se k dispositivos distintos assinarem. O processo continua automático — o app assina por si — mas exige múltiplas assinaturas para aceitar pagamento localmente. Chaves efêmeras + comprovação de posse Cada app gera chaves efêmeras (rotativas) para assinar encontros BLE. A prova da chave mestra só é revelada no sync para provar autenticidade sem expor privacidade. Prova de proximidade reforçada Não confies só no RSSI. Combine: RSSI + BLE timestamp + nonce trocado entre sender/receiver + curta janela temporal. Esses elementos entram na assinatura como metadata. Rate-limits e anti-bot heuristic Device cap: um dispositivo só pode assinar N txs por hora com recompensa plena; acima disso, recompensa decresce automaticamente. Heurísticas locais: comportamento anômalo (padrão de assinaturas em série, sempre nas mesmas coordenadas) reduz a confiança temporária. Trust Score bootstrap + penalidade Dispositivos novos começam com TS baixo; só recebem recompensa plena após prova de honestidade (ex.: 50 assinaturas confirmadas sem disputa). Slashing de reputação/stake quando a rede comprova conluio. Temporary lock / provisional balance Quando k assinaturas são coletadas, geramos um temporary lock (pequena prova compacta). Esse lock é o que previne uma segunda transação imediata — outras lojas veem o lock ao sincronizar parcialmente. Locks podem ser submetidos em batches à L1 (baixo custo). Submissão Merkle &amp; janela de challenge Validadores agregam txs em um LB; só o merkle_root vai pra chain quando sincronizam. Janela de disputa (p.ex. 24–72h) permite reversão e slashing com evidências. Incentivo antifraude Recompensa dividida: parte para validadores, parte para quem submete LB, parte para fundo de disputa. Limitar ganho por dispositivo. k = 3 assinaturas de dispositivos distintos. Rate limit: max 20 assinaturas recompensadas / dispositivo / dia. Lock TTL (tempo que uma temporary lock é considerado válido localmente) = 30–120 minutos (ajustável por comunidade). Janela de challenge = 48 horas por default. TS inicial = 0; recompensa plena depois de 50 confirmações honestas. ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Seguranca","#finder/Bluetooth"],"headers":[{"heading":"O que funciona com validação automática BLE","level":3,"id":"O_que_funciona_com_validação_automática_BLE_0"},{"heading":"Riscos e ataques óbvios","level":3,"id":"Riscos_e_ataques_óbvios_0"},{"heading":"Mudanças concretas (mantendo BLE automático, mas seguro)","level":3,"id":"Mudanças_concretas_(mantendo_BLE_automático,_mas_seguro)_0"},{"heading":"Parâmetros práticos (sugestão inicial)","level":3,"id":"Parâmetros_práticos_(sugestão_inicial)_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"validacao-bluetooth.html","pathToRoot":".","attachments":[],"createdTime":1765620743932,"modifiedTime":1765721803066,"sourceSize":3390,"sourcePath":"Projetos/ProofOfLocalTrust/Validacao Bluetooth.md","exportPath":"validacao-bluetooth.html","showInTree":true,"treeOrder":8,"backlinks":[],"type":"markdown"},"whitepaper-l2-ton.html":{"title":"Whitepaper L2 TON","icon":"","description":"Criar uma Layer-2 (rollup / payment chain) que execute o protocolo Proof of Local Trust (PoLT) — validação permissionless via mesh BLE, validação local por quorum (k, ex.:5), geração de Local Blocks (LB) com assinaturas agregadas (BLS threshold) e settlement (registro de merkle_root / agg_sig) na TON L1 para finalidade e interoperabilidade.\nObjetivos principais: Pagamentos offline seguros e rápidos (micropagamentos). Validação permissionless, sem autoridade central. Finalidade econômica via ancoragem em TON (batching para reduzir custos).\n(Referências TON: Blueprint / Tact / Jettons). [Mobile PoLT Mesh (BLE/libp2p)] &lt;-- gossip --&gt; [Validator Nodes (Rust/Go) local] | | v v Create LB (merkle_root + agg_sig BLS) -----&gt; [L2 Rollup Engine / Sequencer] | v Batch merkle_roots | v TON L1 (settlement) L3 (App / Mesh): wallet mobile (React Native), BLE/libp2p para gossip e sign requests. L2 (tuas regras PoLT): rollup/sidechain que mantém contabilidade, disputa, staking &amp; slashing, tokenomics. L1 (TON): registra batches (merkle_roots + metadata) como prova de existência/finalidade — usa Tact/Blueprint e jettons para integração. Transação offline (TO) — JSON (exemplo):{ \"tx_id\": \"H(sender||nonce||amount||ts||meta)\", \"sender_pub\": \"0x..\", \"receiver_pub\": \"0x..\", \"amount\": 1000000, \"local_nonce\": 42, \"ts_local\": 1690000000, \"metadata\": {\"purpose\":\"purchase\",\"merchant\":\"id\"}, \"sig_sender\": \"ED25519(...)\"\n}\nsig_meta (assinatura BLE de validador):{ \"device_hash\": \"H(device_pubkey)\", \"rssi\": -67, \"ts\": 1690000001, \"ephemeral_pub\": \"0x..\", \"sig\": \"ED25519(ephemeral_priv, tx_id || nonce || ts || rssi)\"\n}\nLocal Block (LB) — armazenamento local / merkle_root:{ \"lb_id\": \"H(prev_lb_hash||merkle_root||ts||validators_commitment)\", \"txs\": [...], \"merkle_root\": \"0x...\", \"validators_meta\": [ {device_hash, ephemeral_pub, sig_meta}, ... ], \"agg_sig\": \"BLS_agg(...)\", \"submitted\": false\n}\nPayload de ancoragem para TON (batch):{ \"batch_id\": \"H(timestamp||chain_id||merkle_root_batch)\", \"merkle_root_batch\": \"0x...\", \"agg_sigs_commitment\": \"0x...\", \"meta\": { \"num_LBs\": 12, \"total_value\": 1234500000 }\n} Criação: Sender cria TO e envia via BLE ao Receiver. Broadcast de pedido de assinatura: Receiver gossipa SIGN_REQUEST com tx_id. Assinaturas locais: Qualquer nó da mesh que passar checagens automáticas (nonce, saldo provisório, rate-limit, prova proximidade) assina com chave efêmera e envia sig_meta. Quorum (k): Quando Receiver coleta ≥k sig_meta válidas (device_hash distintos e heurísticas ok), LB inclui a TX e calcula merkle_root. Agg_sig: as k participações formam um agg_sig BLS (threshold) para compressão/verificação on-chain. Bibliotecas BLS/WASM permitem isso em mobile/nodes. Temporary lock: gera-se lock local (prova compacta) para reduzir double-spend até sync. Gossip LB: LB é gossipado pela mesh (replicação local). Sync/Submit: qualquer node com internet submete batch(s) de merkle_roots/agg_sigs para L2/Sequencer; L2 valida e publica merkle_root_batch na TON (mensagem contract). Challenge window: após publicação na TON, abre-se janela (ex.: 48h) para disputas; provas aceitas = logs BLE assinados, receipts, testemunhas. Em caso de fraude, slashing é aplicado no L2. Validation policy (permissionless): Auto-sign via BLE para qualquer app com regras locais. Assinaturas só têm peso se device TS ≥ threshold or ephemeral checks pass. Quorum k (configurável): default urbano k=5; rural k=3 com restrições de valor. Selection / fairness: para tarefas como criação sequencer LB, usa VRF shuffle + TS-weight to choose aggregator / submitter (evita monopolização). Assinatura agregada: BLS threshold para reduzir footprint on-chain e simplificar verificação. Use implementações maduras (herumi/bls, noble-bls12-381, celo threshold libraries). Rate limits &amp; heuristics: cap signatures por device / periodo; detecção de padrões de emulação. Trust Score (TS): dispositivo inicia com TS baixo; aumenta com comportamento honesto (LBs confirmados sem disputa). Recompensas ponderadas por TS. Stake opcional para validadores de alto peso: um stake mínimo S_min para quem quer maior recompensa/privilege; slashing se fraude comprovada. PoW leve (opcional) para bootstrapping: puzzle barato para cada new device/day, caro em escala massiva. Temporary locks &amp; nonces combinados para reduzir janela prática de double-spend. Challenge window + evidências: verificação automática de logs BLE assinados e provas baseadas em merkle proofs; slashing automático se provas válidas. Essas camadas juntas tornam ataques Sybil/colusão economicamente caros e detectáveis. (Trade-off: introduz fricção inicial.)Token nativo L2: POLT (exemplo) — funções: taxas, staking, slashing, recompensas. Supply &amp; distribution (exemplo): Total 1,000,000,000 POLT 40% ecosystem / rewards (long vesting) 20% team/advisors (vesting) 20% community / pilots 20% treasury / partnerships Tax split (por LB / tx): 40% → validadores (pro rata por TS) 30% → submitter / sequencer 20% → dispute fund (insurance) 10% → governance pool / local community Staking &amp; slashing: validadores que suportam maior peso podem fazer stake; prova de fraude leva a slashing parcial. Micropayment economics: tiny fees para cada tx (rateable), locks reduzem necessidade de altas taxas — batching em TON reduz custo global. Registro/anchor: L2 sequencer envia transações a um contract na TON que registra merkle_root_batch e metadata (batch_id, agg_sig_commitment). Use Blueprint / Tact para escrever e deploy do contrato. Jettons: para token nativo ou integrações com TON wallets, adotar padrão Jetton (TEP) para compatibilidade com wallets TON (Tonkeeper, Tonhub etc.). Frequência de anchoring: configurar batching (ex.: a cada 5–15 min para rotina; daily para “ultimate” anchoring). Batch para Bitcoin é opcional para ultimate finality. TON dev stack: Blueprint (npm create ton), Tact docs/SDK. BLS / threshold libs: herumi/bls, celo threshold bls, noble-bls12-381, threshold-bls crates (Rust). Use wasm bindings para mobile JS. Mesh: libp2p (BLE + mesh), ou soluções orientadas para mobile + bluetooth stacks. Mobile: React Native + libsodium / tweetnacl para ED25519; wasm wrapper para BLS/threshold. L2 engine: pode ser um sequencer simples (Rust/Go) que valida agg_sig e mantém estado; rollup design (optimistic or zk approach) opcional dependendo de recursos. Testing / infra: Chainstack / local TON testnet for contract deploy &amp; testing. Semana 0–2: especificação de mensagens BLE, estrutura do LB, e wireframes wallet. Semana 2–8: protótipo mobile: criar TO, broadcast SIGN_REQUEST, coletar k sigs (simulador local). Implementação de chaves efêmeras. Semana 8–14: validator node (Rust/Go) que cria LB, gera agg_sig (use library BLS), gossip mesh e persistência local. Semana 14–20: sequencer L2 básico (testnet) que aceita merkle_root, aplica regras de disputa e guarda estado; contrato Tact/Blueprint na TON testnet que registra batches. Semana 20–30: piloto controlado (1 bairro) — medir latência, false positives/negatives, atacar com simulações Sybil, ajustar parâmetros (k, TTL, limits). Semana 30+: auditoria, auditoria de crypto (BLS), integração wallets TON, scale-up. Verificar implementação BLS/threshold (DKG seguro se necessário). Testes adversariais: Sybil, colusão local, replay, rush submit. Revisão do contract Tact (registro batches) e manejo de disputas. Proteções de privacidade (evitar gravação de geo exato em L1). // Receiver side\non_receive(TX_OFFER from sender): if wallet.provisional_balance &gt;= amount and nonce_ok: broadcast_mesh({type:\"SIGN_REQUEST\", tx_id, local_nonce}) sigs = [] while sigs.count &lt; k and timeout not passed: resp = wait(SIGN_RESPONSE) if valid_sig_meta(resp): sigs.append(resp) if sigs.count &gt;= k: agg_sig = BLS_aggregate(sigs.ephemeral_sigs) LB = create_local_block([tx], merkle_root([txs]), agg_sig, validators_meta) store(LB) create_temporary_lock(tx.sender, amount, TTL) gossip_mesh({type:\"NEW_LB\", LB}) // Sequencer / any node with internet\nperiodic(): batches = collect_unsubmitted_LBs(max_batch_size) merkle_root_batch = merkle_root(batches.merkle_roots) payload = {batch_id, merkle_root_batch, commitments} send_to_ton_contract(payload) mark_submitted(batches) % txs confirmadas localmente (k sigs) vs % finalizadas on-chain. Latência média para k sigs (segundos). % de disputas por 1000 LBs (indicador de fraude). Custo on-chain / tx (TON fees / batch). Eficácia anti-Sybil (número médio de devices honestos vs detectados). Implementar PoLT como L2 sobre TON é viável e pragmático: dá-te controle total sobre regras locais, aproveita ferramentas (Tact/Blueprint, Jettons, TON Connect) e mantém ancoragem segura na TON. A parte crítica é implementar corretamente BLS/threshold, regras anti-Sybil (TS, rate limits, PoW leve opcional) e um mecanismo de disputas robusto.","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/L2","#finder/TON","#finder/Whitepaper"],"headers":[{"heading":"PoLT sobre L2 ligada à TON — Mini-Whitepaper (resumo técnico)","level":1,"id":"PoLT_sobre_L2_ligada_à_TON_—_Mini-Whitepaper_(resumo_técnico)_0"},{"heading":"1 — Visão &amp; objetivos","level":2,"id":"1_—_Visão_&_objetivos_0"},{"heading":"2 — Camadas da arquitetura (alto nível)","level":2,"id":"2_—_Camadas_da_arquitetura_(alto_nível)_0"},{"heading":"3 — Principais formatos de dados","level":2,"id":"3_—_Principais_formatos_de_dados_0"},{"heading":"4 — Fluxo de uma transação (detalhado)","level":2,"id":"4_—_Fluxo_de_uma_transação_(detalhado)_0"},{"heading":"5 — Consenso &amp; seleção de validadores locais","level":2,"id":"5_—_Consenso_&_seleção_de_validadores_locais_0"},{"heading":"6 — Anti-Sybil, segurança e disputas","level":2,"id":"6_—_Anti-Sybil,_segurança_e_disputas_0"},{"heading":"Camadas combinadas (defesa em profundidade)","level":3,"id":"Camadas_combinadas_(defesa_em_profundidade)_0"},{"heading":"7 — Tokenomics (modelo simples inicial)","level":2,"id":"7_—_Tokenomics_(modelo_simples_inicial)_0"},{"heading":"8 — Integração com TON (prática)","level":2,"id":"8_—_Integração_com_TON_(prática)_0"},{"heading":"9 — Ferramentas &amp; libs recomendadas","level":2,"id":"9_—_Ferramentas_&_libs_recomendadas_0"},{"heading":"10 — MVP Roadmap (prático)","level":2,"id":"10_—_MVP_Roadmap_(prático)_0"},{"heading":"11 — Segurança: checklist para auditoria","level":2,"id":"11_—_Segurança_checklist_para_auditoria_0"},{"heading":"12 — Pseudocódigo crítico (BLE → agg_sig → submit)","level":2,"id":"12_—_Pseudocódigo_crítico_(BLE_→_agg_sig_→_submit)_0"},{"heading":"13 — Métricas &amp; KPIs para piloto","level":2,"id":"13_—_Métricas_&_KPIs_para_piloto_0"},{"heading":"14 — Conclusão curta","level":2,"id":"14_—_Conclusão_curta_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"whitepaper-l2-ton.html","pathToRoot":".","attachments":[],"createdTime":1765620856422,"modifiedTime":1765721807930,"sourceSize":10982,"sourcePath":"Projetos/ProofOfLocalTrust/Whitepaper L2 TON.md","exportPath":"whitepaper-l2-ton.html","showInTree":true,"treeOrder":9,"backlinks":[],"type":"markdown"},"whitepaper-tecnico-v1.html":{"title":"Whitepaper Tecnico v1","icon":"","description":"PoLT é um protocolo de consenso híbrido pensado para pagamentos offline + economia local, onde validadores locais (representantes comunitários) ganham poder de validação com base em Trust Score (reputação local) e colaboram com a cadeia global para evitar double-spend e manter segurança.Objetivos principais: Permitir pagamentos entre pares sem conexão contínua. Preservar segurança global ao sincronizar blocos locais. Incentivar participação social (voluntariado, serviços) como moeda social. Ser leve para dispositivos móveis e suportar comunicações Bluetooth / mesh / QR. Usuários (U) — portadores de wallets com chaves privadas. Validadores Locais (VL) — nós comunitários (p.ex. vendedores, ONGs, escolas) com boa Trust Score. Mininó (MN) — dispositivo móvel que cria e guarda transações locais. Bloco Local (LB) — agrupamento de transações offline assinado por um conjunto de validadores locais. Rede Global (RG) — L1/L2 principal que recebe e armazena LBs como provas. Oráculos de Confirmação (OC) — serviços (descentralizados) que verificam provas externas (ex: dados de energia, ações sociais). Ledger Global (GL) — blockchain global que registra hashes dos LBs e confirma transações finalizadas. Transação Offline (TO): tx_id = H(pubkey_sender || nonce || amount || timestamp || metadata) sender_pubkey, receiver_pubkey amount local_nonce (monotônico por wallet local) timestamp_local signature_sender Mini-bloco local (LB): lb_id = H(prev_lb_hash || timestamp || merkle_root(transactions) || validator_signatures) transactions[] (list of TO) validator_signatures[] (sig of each VL que aprovou o LB) attestation_metadata (local group id, geo-hash opcional) Entradas no Ledger Global:\nregistro: (lb_id, merkle_root, validator_commitment, sync_timestamp, global_signature)\nTrust Score é numérico (por exemplo 0–10,000) e recalculado periodicamente.Fontes de aumento: transações validadas (peso leve) tempo de operação sem reporte de fraude (peso médio) avaliações P2P (votos positivos) validação de oráculos externos (p.ex. participação social) Penalidades: transações revertidas por double-spend taxas de disputa vencidas reports com evidência Fórmula base (exemplo):\nTS_new = TS_old + α valid_tx + β uptime + γ positive_votes − δ fraud_penalties\n(α,β,γ,δ parâmetros ajustáveis por governance)Trust Score é atestado por assinaturas de múltiplos nodes e colocado no perfil do validador. Sender cria TO, assina com chave privada. Sender transmite TO via Bluetooth/NFC/QR para Receiver. Receiver checa local_nonce + saldo local contabilizado (wallet offline mantém “estado provisório”). Um conjunto de ≥k validadores locais (por proximidade/participação) assinam a TO, formando prova local. k pode variar por segurança (p.ex. 3). TO entra no LB local e é dada confirmação local (wallets podem aceitar pagamento com confirmação local). Ao reconectar, o MN (ou VL) submete LB para Rede Global. Rede Global verifica: assinaturas dos validadores (e TS mínima), ausência de double-spend (checa nonces e histórico global), se ok → grava hash do LB no GL (finalidade). Se houver conflito (double-spend identificado), aplica regras de disputa (ver abaixo). Observação: até sincronização, estados são provisionais; aplicações podem decidir nível de confiança aceitável (ex: loja aceita com 1 validação; mercado exige LB gravado na rede).Mecanismos combinados: Local nonces: cada wallet offline mantém um contador monotônico. Validadores exigem nonce correto. Multi-sig local (k-of-n): exige assinatura de múltiplos VLs para cada TO; dificulta gasto duplicado por um único nó comprometido. Timeout &amp; lock: quando uma TO é assinada localmente, a wallet pode publicar um temporary lock na rede (pequena prova que ocupa um espaço no GL sem custo alto) — opcional. Reconciliation on sync: Ao receber LBs, RG checa para cada tx se já existe gasto globalmente. Conflitos: resolve por timestamp_global + Trust Score weight dos validadores; pode reverter transações menos confiáveis ou penalizar VLs culpados. Challenge window: janela (ex: 24–72h) após LB submission onde disputas podem ser abertas; provas e testemunhas (logs Bluetooth, receipts) são aceitas como evidência. Token nativo (POLT) funções: pagamento de taxas de sincronização recompensa para VLs (por validação e honestidade) staking para candidatar-se a VL comprar reputação/votes em governance Modelo: VL stake mínimo S_min para participar. Recompensa por LB validado = base_reward + fee_share. Penalidade: stake slashing quando fraude comprovada. Parte das taxas vai para fundo comunitário (governance local). Monetização para fundadores/operadores: reservas iniciais do token (vesting) taxas de integração com empresas/merchants venda de serviços de nó/hosting para regiões sem infraestrutura Principais ameaças: Sybil (criar muitos nós falsos) → mitigado por stake + verificação social + oráculos. Collusão de validadores locais → mitigado por k-of-n, penalidades e verificação externa. Reprodução de transações offline (replay) → nonces + timestamps + merkle proofs. Ataque de sincronização adversária → nós honestos com maior TS e oráculos escalonam. Falsificação de evidências → aceitar apenas provas assinadas criptograficamente (logs assinado, receipts). Boas práticas: usar ED25519 para assinaturas SHA-3/Keccak para hashing relógio seguro com drift mitigation (tolerância de tempo) usar oráculos descentralizados para dados externos quando necessário Parâmetros (k, S_min, slashing rates, challenge window) ajustáveis via DAO local/global. Governança multi-nível: decisões locais por comunidades; mudanças de protocolo por voto global ponderado por TS e stake. Wallet mobile: gerar tx offline, view provisional balance, sync LB. VL node: recebe TOs via BLE/mesh, verifica, assina, cria LB, submete. Sync API: endpoint para enviar LB ao RG; resposta com status (accepted / rejected / dispute). Explorer: view global de LBs e Trust Scores. Exemplos endpoints (simplificados): POST /lb/submit {lb, proof} -&gt; {status, lb_hash} GET /tx/{tx_id} -&gt; {status, confirmations, lb_hash} POST /dispute {evidence} -&gt; {status} Client / Wallet: React Native (mobile), libs: libsodium / tweetnacl (crypto) VL Node: lightweight Go / Rust binary (para baixo consumo) Comm channels: Bluetooth Low Energy, libp2p (mesh), QR fallback Global Chain: Substrate (Polkadot) ou TON/EVM-compatible as L1 — facilita criar L2 custom Oráculos: Chainlink type or decentralized relay Database local: SQLite (mobile) para ledger provisório Semana 0–4: especificação técnica + protótipo do formato de tx + wireframes da wallet. Semana 4–12: protótipo mobile que cria TOs e envia por BLE; simples VL em NodeJS que assina. Semana 12–20: mini-rede local (3 VLs) com LB creation e sincronização para um testnet L1 (Substrate local). Semana 20–28: mecanismo de Trust Score básico e UI de avaliação P2P. Semana 28–40: stress tests offline, ataques simulados, ajustes; criar docs e whitepaper público. Lançamento pilot: 1 comunidade/região (por exemplo, um bairro ou escola) por 6 meses. micropagamentos em mercados sem internet pagamentos escolares (cantina) economia local entre produtores e consumidores rurais programas sociais com distribuição de benefícios controlada por confiança ","aliases":[],"inlineTags":[],"frontmatterTags":["#finder/Blockchain","#finder/PoLT","#finder/Whitepaper"],"headers":[{"heading":"Proof of Local Trust (PoLT) — Whitepaper inicial (resumo técnico)","level":1,"id":"Proof_of_Local_Trust_(PoLT)_—_Whitepaper_inicial_(resumo_técnico)_0"},{"heading":"1. Visão geral","level":2,"id":"1._Visão_geral_0"},{"heading":"2. Componentes principais","level":2,"id":"2._Componentes_principais_0"},{"heading":"3. Estrutura de dados (simplificada)","level":2,"id":"3._Estrutura_de_dados_(simplificada)_0"},{"heading":"4. Trust Score (TS)","level":2,"id":"4._Trust_Score_(TS)_0"},{"heading":"5. Fluxo de pagamento offline (alto nível)","level":2,"id":"5._Fluxo_de_pagamento_offline_(alto_nível)_0"},{"heading":"6. Anti–Double-Spending e resolução de conflitos","level":2,"id":"6._Anti–Double-Spending_e_resolução_de_conflitos_0"},{"heading":"7. Incentivos e Tokenomics","level":2,"id":"7._Incentivos_e_Tokenomics_0"},{"heading":"8. Segurança — ameaças e proteções","level":2,"id":"8._Segurança_—_ameaças_e_proteções_0"},{"heading":"9. Regras de governança e parâmetros ajustáveis","level":2,"id":"9._Regras_de_governança_e_parâmetros_ajustáveis_0"},{"heading":"10. APIs e interfaces (MVP)","level":2,"id":"10._APIs_e_interfaces_(MVP)_0"},{"heading":"11. Tecnologia sugerida (stack)","level":2,"id":"11._Tecnologia_sugerida_(stack)_0"},{"heading":"12. MVP Roadmap (prático)","level":2,"id":"12._MVP_Roadmap_(prático)_0"},{"heading":"13. Casos de uso (exemplos reais)","level":2,"id":"13._Casos_de_uso_(exemplos_reais)_0"},{"heading":"Resumo rápido","level":3,"id":"Resumo_rápido_0"}],"links":[],"author":"","coverImageURL":"","fullURL":"whitepaper-tecnico-v1.html","pathToRoot":".","attachments":[],"createdTime":1765620719062,"modifiedTime":1765721813037,"sourceSize":8725,"sourcePath":"Projetos/ProofOfLocalTrust/Whitepaper Tecnico v1.md","exportPath":"whitepaper-tecnico-v1.html","showInTree":true,"treeOrder":10,"backlinks":[],"type":"markdown"}},"fileInfo":{"analise-de-riscos.html":{"createdTime":1765620730009,"modifiedTime":1765721746703,"sourceSize":4862,"sourcePath":"Projetos/ProofOfLocalTrust/Analise de Riscos.md","exportPath":"analise-de-riscos.html","showInTree":true,"treeOrder":0,"backlinks":[],"type":"markdown","data":null},"arquitetura-mesh-offline.html":{"createdTime":1765620790186,"modifiedTime":1765721765495,"sourceSize":5745,"sourcePath":"Projetos/ProofOfLocalTrust/Arquitetura Mesh Offline.md","exportPath":"arquitetura-mesh-offline.html","showInTree":true,"treeOrder":1,"backlinks":[],"type":"markdown","data":null},"comparativo-seguranca-bitcoin.html":{"createdTime":1765620803538,"modifiedTime":1765721771139,"sourceSize":3250,"sourcePath":"Projetos/ProofOfLocalTrust/Comparativo Seguranca Bitcoin.md","exportPath":"comparativo-seguranca-bitcoin.html","showInTree":true,"treeOrder":2,"backlinks":[],"type":"markdown","data":null},"conceito-polt.html":{"createdTime":1765620702620,"modifiedTime":1765721776324,"sourceSize":2856,"sourcePath":"Projetos/ProofOfLocalTrust/Conceito PoLT.md","exportPath":"conceito-polt.html","showInTree":true,"treeOrder":3,"backlinks":[],"type":"markdown","data":null},"consenso-k-of-n.html":{"createdTime":1765620759476,"modifiedTime":1765721781600,"sourceSize":4456,"sourcePath":"Projetos/ProofOfLocalTrust/Consenso k-of-n.md","exportPath":"consenso-k-of-n.html","showInTree":true,"treeOrder":4,"backlinks":[],"type":"markdown","data":null},"estrategia-l2-ton.html":{"createdTime":1765620805427,"modifiedTime":1765721787032,"sourceSize":3732,"sourcePath":"Projetos/ProofOfLocalTrust/Estrategia L2 TON.md","exportPath":"estrategia-l2-ton.html","showInTree":true,"treeOrder":5,"backlinks":[],"type":"markdown","data":null},"introducao-inovacao.html":{"createdTime":1765620677925,"modifiedTime":1765721793300,"sourceSize":2709,"sourcePath":"Projetos/ProofOfLocalTrust/Introducao Inovacao.md","exportPath":"introducao-inovacao.html","showInTree":true,"treeOrder":6,"backlinks":[],"type":"markdown","data":null},"regras-de-seguranca.html":{"createdTime":1765620779410,"modifiedTime":1765721798347,"sourceSize":5308,"sourcePath":"Projetos/ProofOfLocalTrust/Regras de Seguranca.md","exportPath":"regras-de-seguranca.html","showInTree":true,"treeOrder":7,"backlinks":[],"type":"markdown","data":null},"validacao-bluetooth.html":{"createdTime":1765620743932,"modifiedTime":1765721803066,"sourceSize":3390,"sourcePath":"Projetos/ProofOfLocalTrust/Validacao Bluetooth.md","exportPath":"validacao-bluetooth.html","showInTree":true,"treeOrder":8,"backlinks":[],"type":"markdown","data":null},"whitepaper-l2-ton.html":{"createdTime":1765620856422,"modifiedTime":1765721807930,"sourceSize":10982,"sourcePath":"Projetos/ProofOfLocalTrust/Whitepaper L2 TON.md","exportPath":"whitepaper-l2-ton.html","showInTree":true,"treeOrder":9,"backlinks":[],"type":"markdown","data":null},"whitepaper-tecnico-v1.html":{"createdTime":1765620719062,"modifiedTime":1765721813037,"sourceSize":8725,"sourcePath":"Projetos/ProofOfLocalTrust/Whitepaper Tecnico v1.md","exportPath":"whitepaper-tecnico-v1.html","showInTree":true,"treeOrder":10,"backlinks":[],"type":"markdown","data":null},"site-lib/scripts/graph-wasm.wasm":{"createdTime":1765720745395,"modifiedTime":1765720743237.4358,"sourceSize":23655,"sourcePath":"","exportPath":"site-lib/scripts/graph-wasm.wasm","showInTree":false,"treeOrder":0,"backlinks":[],"type":"other","data":null},"site-lib/fonts/94f2f163d4b698242fef.otf":{"createdTime":1765722106507,"modifiedTime":1765722106507,"sourceSize":66800,"sourcePath":"","exportPath":"site-lib/fonts/94f2f163d4b698242fef.otf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/72505e6a122c6acd5471.woff2":{"createdTime":1765722106508,"modifiedTime":1765722106508,"sourceSize":104232,"sourcePath":"","exportPath":"site-lib/fonts/72505e6a122c6acd5471.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/2d5198822ab091ce4305.woff2":{"createdTime":1765722106509,"modifiedTime":1765722106509,"sourceSize":104332,"sourcePath":"","exportPath":"site-lib/fonts/2d5198822ab091ce4305.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/c8ba52b05a9ef10f4758.woff2":{"createdTime":1765722106517,"modifiedTime":1765722106517,"sourceSize":98868,"sourcePath":"","exportPath":"site-lib/fonts/c8ba52b05a9ef10f4758.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/cb10ffd7684cd9836a05.woff2":{"createdTime":1765722106510,"modifiedTime":1765722106510,"sourceSize":106876,"sourcePath":"","exportPath":"site-lib/fonts/cb10ffd7684cd9836a05.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/293fd13dbca5a3e450ef.woff2":{"createdTime":1765722106519,"modifiedTime":1765722106519,"sourceSize":105924,"sourcePath":"","exportPath":"site-lib/fonts/293fd13dbca5a3e450ef.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/085cb93e613ba3d40d2b.woff2":{"createdTime":1765722106520,"modifiedTime":1765722106520,"sourceSize":112184,"sourcePath":"","exportPath":"site-lib/fonts/085cb93e613ba3d40d2b.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/b5f0f109bc88052d4000.woff2":{"createdTime":1765722106522,"modifiedTime":1765722106522,"sourceSize":105804,"sourcePath":"","exportPath":"site-lib/fonts/b5f0f109bc88052d4000.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/cbe0ae49c52c920fd563.woff2":{"createdTime":1765722106530,"modifiedTime":1765722106530,"sourceSize":106108,"sourcePath":"","exportPath":"site-lib/fonts/cbe0ae49c52c920fd563.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/535a6cf662596b3bd6a6.woff2":{"createdTime":1765722106534,"modifiedTime":1765722106534,"sourceSize":111708,"sourcePath":"","exportPath":"site-lib/fonts/535a6cf662596b3bd6a6.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/70cc7ff27245e82ad414.ttf":{"createdTime":1765722106546,"modifiedTime":1765722106546,"sourceSize":192740,"sourcePath":"","exportPath":"site-lib/fonts/70cc7ff27245e82ad414.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/454577c22304619db035.ttf":{"createdTime":1765722106548,"modifiedTime":1765722106548,"sourceSize":161376,"sourcePath":"","exportPath":"site-lib/fonts/454577c22304619db035.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/52ac8f3034507f1d9e53.ttf":{"createdTime":1765722106549,"modifiedTime":1765722106549,"sourceSize":191568,"sourcePath":"","exportPath":"site-lib/fonts/52ac8f3034507f1d9e53.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/05b618077343fbbd92b7.ttf":{"createdTime":1765722106551,"modifiedTime":1765722106551,"sourceSize":155288,"sourcePath":"","exportPath":"site-lib/fonts/05b618077343fbbd92b7.ttf","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/fonts/4bb6ac751d1c5478ff3a.woff2":{"createdTime":1765722106503,"modifiedTime":1765722106503,"sourceSize":7876,"sourcePath":"","exportPath":"site-lib/fonts/4bb6ac751d1c5478ff3a.woff2","showInTree":false,"treeOrder":0,"backlinks":[],"type":"font","data":null},"site-lib/media/6155340132a851f6089e.svg":{"createdTime":1765722106505,"modifiedTime":1765722106505,"sourceSize":315,"sourcePath":"","exportPath":"site-lib/media/6155340132a851f6089e.svg","showInTree":false,"treeOrder":0,"backlinks":[],"type":"media","data":null},"site-lib/media/2308ab1944a6bfa5c5b8.svg":{"createdTime":1765722106506,"modifiedTime":1765722106506,"sourceSize":278,"sourcePath":"","exportPath":"site-lib/media/2308ab1944a6bfa5c5b8.svg","showInTree":false,"treeOrder":0,"backlinks":[],"type":"media","data":null},"site-lib/html/file-tree-content.html":{"createdTime":1765722106997,"modifiedTime":1765722106997,"sourceSize":4000,"sourcePath":"","exportPath":"site-lib/html/file-tree-content.html","showInTree":false,"treeOrder":0,"backlinks":[],"type":"html","data":null},"site-lib/scripts/webpage.js":{"createdTime":1765720746200,"modifiedTime":1765720746200,"sourceSize":110729,"sourcePath":"","exportPath":"site-lib/scripts/webpage.js","showInTree":false,"treeOrder":0,"backlinks":[],"type":"script","data":null},"site-lib/scripts/graph-wasm.js":{"createdTime":1765720746200,"modifiedTime":1765720746200,"sourceSize":12885,"sourcePath":"","exportPath":"site-lib/scripts/graph-wasm.js","showInTree":false,"treeOrder":0,"backlinks":[],"type":"script","data":null},"site-lib/scripts/graph-render-worker.js":{"createdTime":1765720746200,"modifiedTime":1765720746200,"sourceSize":5681,"sourcePath":"","exportPath":"site-lib/scripts/graph-render-worker.js","showInTree":false,"treeOrder":0,"backlinks":[],"type":"script","data":null},"site-lib/media/favicon.png":{"createdTime":1765722106256,"modifiedTime":1765722106256,"sourceSize":1105,"sourcePath":"","exportPath":"site-lib/media/favicon.png","showInTree":false,"treeOrder":0,"backlinks":[],"type":"media","data":null},"site-lib/styles/obsidian.css":{"createdTime":1765722106778,"modifiedTime":1765722106778,"sourceSize":205827,"sourcePath":"","exportPath":"site-lib/styles/obsidian.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/other-plugins.css":{"createdTime":1765721907760,"modifiedTime":1765721907760,"sourceSize":12687,"sourcePath":"","exportPath":"site-lib/styles/other-plugins.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/theme.css":{"createdTime":1765720746452,"modifiedTime":1765720746452,"sourceSize":11144,"sourcePath":"","exportPath":"site-lib/styles/theme.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/global-variable-styles.css":{"createdTime":1765722106442,"modifiedTime":1765722106442,"sourceSize":436,"sourcePath":"","exportPath":"site-lib/styles/global-variable-styles.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/supported-plugins.css":{"createdTime":1765722106442,"modifiedTime":1765722106442,"sourceSize":5003,"sourcePath":"","exportPath":"site-lib/styles/supported-plugins.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/styles/main-styles.css":{"createdTime":1765720746239,"modifiedTime":1765720746239,"sourceSize":19521,"sourcePath":"","exportPath":"site-lib/styles/main-styles.css","showInTree":false,"treeOrder":0,"backlinks":[],"type":"style","data":null},"site-lib/rss.xml":{"createdTime":1765722107141,"modifiedTime":1765722107141,"sourceSize":47628,"sourcePath":"","exportPath":"site-lib/rss.xml","showInTree":false,"treeOrder":0,"backlinks":[],"type":"other","data":null}},"sourceToTarget":{"Projetos/ProofOfLocalTrust/Analise de Riscos.md":"analise-de-riscos.html","Projetos/ProofOfLocalTrust/Arquitetura Mesh Offline.md":"arquitetura-mesh-offline.html","Projetos/ProofOfLocalTrust/Comparativo Seguranca Bitcoin.md":"comparativo-seguranca-bitcoin.html","Projetos/ProofOfLocalTrust/Conceito PoLT.md":"conceito-polt.html","Projetos/ProofOfLocalTrust/Consenso k-of-n.md":"consenso-k-of-n.html","Projetos/ProofOfLocalTrust/Estrategia L2 TON.md":"estrategia-l2-ton.html","Projetos/ProofOfLocalTrust/Introducao Inovacao.md":"introducao-inovacao.html","Projetos/ProofOfLocalTrust/Regras de Seguranca.md":"regras-de-seguranca.html","Projetos/ProofOfLocalTrust/Validacao Bluetooth.md":"validacao-bluetooth.html","Projetos/ProofOfLocalTrust/Whitepaper L2 TON.md":"whitepaper-l2-ton.html","Projetos/ProofOfLocalTrust/Whitepaper Tecnico v1.md":"whitepaper-tecnico-v1.html","":"site-lib/rss.xml"},"featureOptions":{"backlinks":{"featureId":"backlinks","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".footer","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Backlinks","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"tags":{"featureId":"tags","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".header .data-bar","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"showInlineTags":true,"showFrontmatterTags":true,"info_showInlineTags":{"show":true,"name":"","description":"Show tags defined inside the document at the top of the page.","placeholder":""},"info_showFrontmatterTags":{"show":true,"name":"","description":"Show tags defined in the frontmatter of the document at the top of the page.","placeholder":""}},"alias":{"featureId":"aliases","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".header .data-bar","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Aliases","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"properties":{"featureId":"properties","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":".header","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Properties","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"info_hideProperties":{"show":true,"name":"","description":"A list of properties to hide from the properties view","placeholder":""}},"fileNavigation":{"featureId":"file-navigation","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#left-sidebar-content","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"info_includePath":{"show":false,"name":"","description":"","placeholder":""},"showCustomIcons":false,"showDefaultFolderIcons":false,"showDefaultFileIcons":false,"defaultFolderIcon":"lucide//folder","defaultFileIcon":"lucide//file","defaultMediaIcon":"lucide//file-image","exposeStartingPath":true,"info_showCustomIcons":{"show":true,"name":"","description":"Show custom icons for files and folders","placeholder":""},"info_showDefaultFolderIcons":{"show":true,"name":"","description":"Show a default icon of a folder for every folder in the tree","placeholder":""},"info_showDefaultFileIcons":{"show":true,"name":"","description":"Show a default icon of a file for every file in the tree","placeholder":""},"info_defaultFolderIcon":{"show":true,"name":"","description":"The icon to use for folders. Prefix with 'lucide//' to use a Lucide icon","placeholder":""},"info_defaultFileIcon":{"show":true,"name":"","description":"The icon to use for files. Prefix with 'lucide//' to use a Lucide icon","placeholder":""},"info_defaultMediaIcon":{"show":true,"name":"","description":"The icon to use for media files. Prefix with 'lucide//' to use a Lucide icon","placeholder":""},"info_exposeStartingPath":{"show":true,"name":"","description":"Whether or not to show the current file in the file tree when the page is first loaded","placeholder":""},"includePath":"site-lib/html/file-tree.html"},"search":{"featureId":"search","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#left-sidebar .topbar-content","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Search...","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"outline":{"featureId":"outline","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#right-sidebar-content","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Outline","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"startCollapsed":false,"minCollapseDepth":0,"info_startCollapsed":{"show":true,"name":"","description":"Should the outline start collapsed?","placeholder":""},"info_minCollapseDepth":{"show":true,"name":"","description":"Only allow outline items to be collapsed if they are at least this many levels deep in the tree.","placeholder":"","dropdownOptions":{"1":1,"2":2,"No Collapse":100}}},"themeToggle":{"featureId":"theme-toggle","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#right-sidebar .topbar-content","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""}},"graphView":{"featureId":"graph-view","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"#right-sidebar-content","type":"start","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"displayTitle":"Graph View","info_displayTitle":{"show":true,"name":"","description":"Descriptive title to show above the feature","placeholder":""},"showOrphanNodes":true,"showAttachments":false,"allowGlobalGraph":true,"allowExpand":true,"attractionForce":1,"linkLength":15,"repulsionForce":80,"centralForce":2,"edgePruning":100,"minNodeRadius":3,"maxNodeRadius":7,"info_showOrphanNodes":{"show":true,"name":"","description":"Show nodes that are not connected to any other nodes.","placeholder":""},"info_showAttachments":{"show":true,"name":"","description":"Show attachments like images and PDFs as nodes in the graph.","placeholder":""},"info_allowGlobalGraph":{"show":true,"name":"","description":"Allow the user to view the global graph of all nodes.","placeholder":""},"info_allowExpand":{"show":true,"name":"","description":"Allow the user to pop-out the graph view to take up the whole screen","placeholder":""},"info_attractionForce":{"show":true,"name":"","description":"How much should linked nodes attract each other? This will make the graph appear more clustered.","placeholder":""},"info_linkLength":{"show":true,"name":"","description":"How long should the links between nodes be? The shorter the links the more connected nodes will cluster together.","placeholder":""},"info_repulsionForce":{"show":true,"name":"","description":"How much should nodes repel each other? This will make disconnected parts more spread out.","placeholder":""},"info_centralForce":{"show":true,"name":"","description":"How much should nodes be attracted to the center? This will make the graph appear more dense and circular.","placeholder":""},"info_edgePruning":{"show":true,"name":"","description":"Edges with a length above this threshold will not be rendered, however they will still contribute to the simulation. This can help large tangled graphs look more organised. Hovering over a node will still display these links.","placeholder":""},"info_minNodeRadius":{"show":true,"name":"","description":"How small should the smallest nodes be? The smaller a node is the less it will attract other nodes.","placeholder":""},"info_maxNodeRadius":{"show":true,"name":"","description":"How large should the largest nodes be? Nodes are sized by how many links they have. The larger a node is the more it will attract other nodes. This can be used to create a good grouping around the most important nodes.","placeholder":""}},"sidebar":{"featureId":"sidebar","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"allowResizing":true,"allowCollapsing":true,"rightDefaultWidth":"20em","leftDefaultWidth":"20em","info_allowResizing":{"show":true,"name":"","description":"Whether or not to allow the sidebars to be resized","placeholder":""},"info_allowCollapsing":{"show":true,"name":"","description":"Whether or not to allow the sidebars to be collapsed","placeholder":""},"info_rightDefaultWidth":{"show":true,"name":"","description":"The default width of the right sidebar","placeholder":""},"info_leftDefaultWidth":{"show":true,"name":"","description":"The default width of the left sidebar","placeholder":""}},"customHead":{"featureId":"custom-head","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"featurePlacement":{"selector":"head","type":"end","info_selector":{"show":true,"name":"","description":"CSS selector for an element. The feature will be placed relative to this element.","placeholder":""},"info_type":{"show":true,"name":"","description":"Will this feature be placed before, after, or inside (at the beggining or end).","placeholder":"","dropdownOptions":{"Before":"before","After":"after","Start":"start","End":"end"}}},"info_featurePlacement":{"show":true,"name":"","description":"Where to place this feature on the page. (Relative to the selector)","placeholder":""},"info_includePath":{"show":false,"name":"","description":"","placeholder":""},"sourcePath":"","info_sourcePath":{"show":true,"name":"","description":"The local path to the source .html file which will be included.","placeholder":"","fileInputOptions":{"makeRelativeToVault":true,"browseButton":true}},"includePath":"site-lib/html/custom-head.html"},"document":{"featureId":"obsidian-document","enabled":true,"unavailable":false,"alwaysEnabled":true,"hideSettingsButton":false,"allowFoldingLists":true,"allowFoldingHeadings":true,"documentWidth":"40em","info_allowFoldingLists":{"show":true,"name":"","description":"Whether or not to allow lists to be folded","placeholder":""},"info_allowFoldingHeadings":{"show":true,"name":"","description":"Whether or not to allow headings to be folded","placeholder":""},"info_documentWidth":{"show":true,"name":"","description":"The width of the document","placeholder":""}},"rss":{"featureId":"rss","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":false,"siteUrl":"","authorName":"","info_siteUrl":{"show":true,"name":"","description":"The url that this site will be hosted at","placeholder":"https://example.com/mysite"},"info_authorName":{"show":true,"name":"","description":"The name of the author of the site","placeholder":""}},"linkPreview":{"featureId":"link-preview","enabled":true,"unavailable":false,"alwaysEnabled":false,"hideSettingsButton":true}},"modifiedTime":1765722106813,"siteName":"Nova pasta","vaultName":"Nova pasta","exportRoot":"Projetos/ProofOfLocalTrust","baseURL":"","pluginVersion":"1.9.2","themeName":"","bodyClasses":"publish css-settings-manager styled-scrollbars show-inline-title show-ribbon is-focused","hasFavicon":false}